/*
 * ◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆たい焼き練習問題◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆
 * 上から順番に解答していくと、ひとつのクラスとして完結します。
 * (メソッドやクラスの｛ と ｝は忘れずに書いてクラスの形を整えてください。
 * 　また一部後回しにした方が解答しやすい問題があります。)
 *
 * これが解ければ、クラスとインスタンスについてかなり理解できていると思います。
 * テキストなどを参考に頑張りましょう！
 */

// 問1.Taiyakiクラスを宣言しなさい



// 問2.価格のインスタンスフィールドを宣言しなさい



// 問3.あんの種類のインスタンスフィールドを宣言しなさい



// 問4.たい焼きの生産数をカウントするクラスフィールドを宣言しなさい



// 問5.つぶあんとクリームの定数フィールドを宣言しなさい



// 問6.定価100円の定数フィールドを宣言しなさい



// 問7.フィールドを100円・つぶあんで初期化する引数なしコンストラクタを宣言しなさい



// 問8.価格とあんの種類フィールドを初期化するコンストラクタを宣言しなさい



// 問9.価格を設定するsetPrice()メソッドを宣言しなさい



// 問10.価格を取得するgetPrice()メソッドを宣言しなさい



// 問11.あんの種類を取得するgetType()メソッドを宣言しなさい



// 問12.生産数を取得するgetCount()メソッドを宣言しなさい



// 問13.mainメソッドを宣言しなさい



// 問14.たい焼きのインスタンスを生成しなさい



// 問15.作ったたい焼きのあんの種類を求めなさい



// 問16.クリームたい焼きのインスタンスを生成し、価格を120円に設定しなさい



// 問17.クリームたい焼きの価格が本当に120円か確認しなさい



// 問18.配列を使って、10匹(あん5匹、クリーム5匹)のたい焼きパックを生成しなさい



// 問19.たい焼きパックの価格を求めなさい



// 問20.これまでに焼き上げたたい焼きの匹数を求めなさい


