/*
 * 問題(難)：以下の実行結果になるようにfor文を使ってプログラムを作成してください。
 *
 *	条件：for文の条件式の中に、変数ｘを必ず使用すること。
 *			また、概存のソースを削除しないこと。
 *
 * ヒント：「掛け算」と「割り算」を条件式でうまく使ってください。
 *			あと、条件式に定数(具体的な数字)を入れなくても答えを導けます。
 *
【実行結果】

***********           ***********
*********         *********
*******       *******
*****     *****
****    ****
***   ***
**  **
* *
* *
* *
* *
* *
* *
* *
**  **
***   ***
****    ****
*****     *****
*******       *******
*********         *********
***********           ***********

*/

public class ForQuestion4 {
	public static void main(String[] args) {
		int x = 10;

		// ▽解答欄 ここから
		
		// △解答欄 ここまで

	}
}